In [1]:
#Now we consider a special case in which the two datasets to combine have full or partial same indexes

import pandas as pd
from pandas import DataFrame, Series
import numpy as np

In [5]:
#Creating two Series objects with same indexes bu different values

a = Series([np.nan, 2.5, np.nan, 3.4, 6.7, np.nan], index=list('fedbca'))
b = Series(np.arange(len(a), dtype=np.float64), index=a.index)
b[-1] = np.nan

In [6]:
a

f    NaN
e    2.5
d    NaN
b    3.4
c    6.7
a    NaN
dtype: float64

In [7]:
b

f    0.0
e    1.0
d    2.0
b    3.0
c    4.0
a    NaN
dtype: float64

In [9]:
#We can use the numpy where to pass a condition to combine the datasets as
np.where(pd.isnull(a), b, a)

array([0. , 2.5, 2. , 3.4, 6.7, nan])

In [11]:
#The above expression would return a ndarray with all values of a and values of b where a values were NaN

#A similar function for pandas Series is the combine_first
b[:-2].combine_first(a[2:])

a    NaN
b    3.0
c    6.7
d    2.0
e    1.0
f    0.0
dtype: float64

In [15]:
#The combine_first appears to perform the same task column by column, thus we can use it for dataframes as well
df1 = DataFrame({'a':[1, np.nan, 23, 4.5], 'b':[2.3,1.4, np.nan, 32.4], 'c':np.arange(6,10)})
df2 = DataFrame({'a':[np.nan, 2.4, np.nan, 5.6], 'b':[np.nan,1.4,3.4,np.nan], 'c':np.arange(7,11)})

In [16]:
df1.combine_first(df2)

      a     b  c
0   1.0   2.3  6
1   2.4   1.4  7
2  23.0   3.4  8
3   4.5  32.4  9